<a href="https://colab.research.google.com/github/philipebuka/Hamoye-Internship/blob/master/Hamoye_Stage_A_Assesment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sn

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [22]:
fuel_data = pd.read_csv('https://bit.ly/HDSC-StageOneDataset')
fuel_data.head()

                record_id  ...  fuel_cost_per_mmbtu
0   f1_fuel_1994_12_1_0_7  ...                1.121
1  f1_fuel_1994_12_1_0_10  ...                1.120
2   f1_fuel_1994_12_2_0_1  ...                1.650
3   f1_fuel_1994_12_2_0_7  ...                1.970
4  f1_fuel_1994_12_2_0_10  ...                2.570

[5 rows x 11 columns]

'Record_id' : record id

'Utility_id_ferc1': Utility id assigned by the FERC

'Report_year': year of report

'Plant_name_ferc1': the name of the plant

'Fuel_type_code_pudl': the type of fuel

'Fuel_unit': the unit of fuel

'Fuel_qty_burned': the quantity of fuel burned

'Fuel_mmbtu_per_unit': the measure of energy per unit

'fuel_cost_per_unit_burned': the fuel cost per unit burned

'Fuel_cost_per_unit_delivered': the cost of fuel delivered per unit

'fuel_cost_per_mmbtu': the cost of fuel per mmbtu

MMBTU, or MBTU, stands for one million British Thermal Units (BTU). A BTU is a measure of the energy content in fuel, and is is used in the power, steam generation, heating and air conditioning industries. One BTU is equivalent to1.06 Joules.

In [3]:
fuel_data.describe()

       utility_id_ferc1  ...  fuel_cost_per_mmbtu
count      29523.000000  ...         29523.000000
mean         118.601836  ...            19.304354
std           74.178353  ...          2091.540939
min            1.000000  ...           -41.501000
25%           55.000000  ...             1.940000
50%          122.000000  ...             4.127000
75%          176.000000  ...             7.745000
max          514.000000  ...        359278.000000

[8 rows x 7 columns]

In [ ]:
fuel_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29523 entries, 0 to 29522
Data columns (total 11 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   record_id                     29523 non-null  object
 1   utility_id_ferc1              29523 non-null  int64
 2   report_year                   29523 non-null  int64
 3   plant_name_ferc1              29523 non-null  object
 4   fuel_type_code_pudl           29523 non-null  object
 5   fuel_unit                     29343 non-null  object
 6   fuel_qty_burned               29523 non-null  float64
 7   fuel_mmbtu_per_unit           29523 non-null  float64
 8   fuel_cost_per_unit_burned     29523 non-null  float64
 9   fuel_cost_per_unit_delivered  29523 non-null  float64
 10  fuel_cost_per_mmbtu           29523 non-null  float64
dtypes: float64(5), int64(2), object(4)
memory usage: 2.5+ MB

In [7]:
cost_per_unit = fuel_data[['fuel_type_code_pudl','fuel_cost_per_unit_burned']].groupby('fuel_type_code_pudl').sum()

In [9]:
cost_per_unit

                     fuel_cost_per_unit_burned
fuel_type_code_pudl
coal                                576254.381
gas                                 156891.829
nuclear                            4053318.428
oil                                1361824.819
other                                 3048.394
waste                                 8607.492

In [14]:
fuel_data.isnull().sum()

record_id                         0
utility_id_ferc1                  0
report_year                       0
plant_name_ferc1                  0
fuel_type_code_pudl               0
fuel_unit                       180
fuel_qty_burned                   0
fuel_mmbtu_per_unit               0
fuel_cost_per_unit_burned         0
fuel_cost_per_unit_delivered      0
fuel_cost_per_mmbtu               0
dtype: int64

In [13]:
len(fuel_data) - fuel_data.isnull().sum()

record_id                       29523
utility_id_ferc1                29523
report_year                     29523
plant_name_ferc1                29523
fuel_type_code_pudl             29523
fuel_unit                       29343
fuel_qty_burned                 29523
fuel_mmbtu_per_unit             29523
fuel_cost_per_unit_burned       29523
fuel_cost_per_unit_delivered    29523
fuel_cost_per_mmbtu             29523
dtype: int64

In [11]:
#to get the percentage of missing data in each column
(fuel_data.isnull().sum()/len(fuel_data))*100

record_id                       0.000000
utility_id_ferc1                0.000000
report_year                     0.000000
plant_name_ferc1                0.000000
fuel_type_code_pudl             0.000000
fuel_unit                       0.609694
fuel_qty_burned                 0.000000
fuel_mmbtu_per_unit             0.000000
fuel_cost_per_unit_burned       0.000000
fuel_cost_per_unit_delivered    0.000000
fuel_cost_per_mmbtu             0.000000
dtype: float64

In [15]:
usage_cost_year = fuel_data[['report_year','fuel_cost_per_unit_delivered']].groupby('report_year').sum()
usage_cost_year

             fuel_cost_per_unit_delivered
report_year
1994                         7.859053e+04
1995                         3.931506e+04
1996                         1.000602e+07
1997                         1.218738e+07
1998                         3.178799e+05
1999                         2.682921e+04
2000                         1.352903e+06
2001                         8.142834e+04
2002                         5.735121e+04
2003                         6.740849e+04
2004                         1.663129e+05
2005                         5.258506e+04
2006                         4.805125e+04
2007                         5.476283e+04
2008                         7.194631e+04
2009                         7.975923e+05
2010                         1.158381e+05
2011                         7.412059e+04
2012                         7.581617e+04
2013                         2.065968e+05
2014                         2.256952e+05
2015                         3.569033e+05
2016                         1.074344e+05
2017                         4.587348e+04
2018                         4.748057e+05

In [18]:
skewValue = fuel_data.skew(axis=0)

In [19]:
skewValue

utility_id_ferc1                  0.605070
report_year                       0.006953
fuel_qty_burned                  15.851495
fuel_mmbtu_per_unit               4.135217
fuel_cost_per_unit_burned        19.787440
fuel_cost_per_unit_delivered    105.014227
fuel_cost_per_mmbtu             171.675535
dtype: float64

In [30]:
new_data = fuel_data[['report_year','fuel_qty_burned','fuel_mmbtu_per_unit','fuel_cost_per_unit_burned','fuel_cost_per_unit_delivered','fuel_cost_per_mmbtu']]

In [31]:
new_data

       report_year  ...  fuel_cost_per_mmbtu
0             1994  ...                1.121
1             1994  ...                1.120
2             1994  ...                1.650
3             1994  ...                1.970
4             1994  ...                2.570
...            ...  ...                  ...
29518         2018  ...                9.030
29519         2018  ...                6.950
29520         2018  ...                8.990
29521         2018  ...                1.110
29522         2018  ...               11.680

[29523 rows x 6 columns]

In [35]:
correl = new_data.corr()
correl

                              report_year  ...  fuel_cost_per_mmbtu
report_year                      1.000000  ...             0.010261
fuel_qty_burned                  0.012952  ...            -0.001896
fuel_mmbtu_per_unit             -0.110853  ...            -0.005884
fuel_cost_per_unit_burned        0.013599  ...            -0.000437
fuel_cost_per_unit_delivered    -0.014043  ...            -0.000109
fuel_cost_per_mmbtu              0.010261  ...             1.000000

[6 rows x 6 columns]

In [48]:
diff = fuel_data['fuel_cost_per_unit_burned'].iloc[1998].sum() - fuel_data['fuel_cost_per_unit_burned'].iloc[1994].sum()

In [49]:
(diff/fuel_data['fuel_cost_per_unit_burned'].iloc[1998] + fuel_data['fuel_cost_per_unit_burned'].iloc[1994])*100

273.35153410783437